LEXICON: dict[str, str] = {
    "forward_schedule": ">>",
    "backward_schedule": "<<",
    "forward_rating": ">>",
    "backward_rating": "<<",
    "/start": "✋ Привет,\n🤖 Меня зовут StudentBot.\n🦾 Я могу отправить расписание и баллы БРС!\n\n"
              "⚠️ Для работы со мной, требуется авторизация по паролю и логину.",
    "unvailable": "😊 Извините, данная функция в разработке.",
    "to_main_menu": "👣 Вы вернулись в главное меню!",
    "schedule": "🗓 Я могу отправить расписание на неделю или на конкретный день.",
    "day_schedule": "Выберите день недели.",
    "processing": "🧠 Обрабатываю запрос...",
    "rating": "📝 Я могу отправить вам все ваши баллы БРС или только по конкретному предмету.",
    "already_auth": "❗️ Вы уже авторизованы!",
    "log_in": "▶️ Введите логин от личного кабинета: ",
    "pass_in": "▶️ Введите пароль от личного кабинета: ",
    "connecting_to_PA": "🛜 Подключаюсь к вашему личному кабинету...",
    "incorrect_user_data": "❌ Неправильно введены данные, попробуйте ещё раз...",
    "successful_connection": "✅ Подключение прошло успешно!"
    }

LEXICON_COMMANDS: dict[str, str] = {
    "to_main_menu": "️🔙 В главное меню",
    "schedule": "📅 Расписание",
    "day_schedule": "📆 Расписание на день",
    "week_schedule": "🗓 Расписание на неделю",
    "rating": "📉 Баллы БРС",
    "discipline_rating": "📝 Баллы по предмету",
    "short_rating": "📕 Все баллы кратко",
    "full_rating": "📚 Все баллы подробно",
    "authorisation": "✅ Авторизация"
}
